test/wrk2_wsk/social_network/crazy_results/output_social-graph-follow-with-username-merged.log
Running 2m test @ http://130.127.133.207:32001
  1 threads and 1 connections
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
  Thread calibration: mean lat.: 6278.144ms, rate sampling interval: 18776ms
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28m    32.39s    1.99m    57.58%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.30m 
 75.000%    1.78m 
 90.000%    1.89m 
 99.000%    1.99m 
 99.900%    1.99m 
 99.990%    1.99m 
 99.999%    1.99m 
100.000%    1.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   12861.439     0.000000            1         1.00
   28426.239     0.100000            7         1.11
   42696.703     0.200000           14         1.25
   58556.415     0.300000           20         1.43
   70975.487     0.400000           28         1.67
   78249.983     0.500000           33         2.00
   87293.951     0.550000           38         2.22
   93978.623     0.600000           40         2.50
  100990.975     0.650000           43         2.86
  104726.527     0.700000           48         3.33
  107085.823     0.750000           51         4.00
  107151.359     0.775000           52         4.44
  110559.231     0.800000           54         5.00
  110624.767     0.825000           56         5.71
  113311.743     0.850000           57         6.67
  113377.279     0.875000           58         8.00
  113442.815     0.887500           59         8.89
  116785.151     0.900000           61        10.00
  116785.151     0.912500           61        11.43
  116850.687     0.925000           63        13.33
  116850.687     0.937500           63        16.00
  116850.687     0.943750           63        17.78
  116850.687     0.950000           63        20.00
  119406.591     0.956250           64        22.86
  119406.591     0.962500           64        26.67
  119406.591     0.968750           64        32.00
  119472.127     0.971875           66        35.56
  119472.127     1.000000           66          inf
#[Mean    =    76794.104, StdDeviation   =    32385.740]
#[Max     =   119406.592, Total count    =           66]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   45.85ms
 75.000%    3.46s 
 90.000%    4.12s 
 99.000%    6.62s 
 99.900%    6.92s 
 99.990%    6.92s 
 99.999%    6.92s 
100.000%    6.92s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      30.831     0.000000            1         1.00
      35.839     0.100000            7         1.11
      38.015     0.200000           14         1.25
      39.167     0.300000           21         1.43
      40.319     0.400000           27         1.67
      45.855     0.500000           33         2.00
      96.383     0.550000           37         2.22
    2414.591     0.600000           40         2.50
    2684.927     0.650000           43         2.86
    3407.871     0.700000           47         3.33
    3459.071     0.750000           50         4.00
    3524.607     0.775000           52         4.44
    3553.279     0.800000           53         5.00
    3723.263     0.825000           55         5.71
    3872.767     0.850000           57         6.67
    4106.239     0.875000           58         8.00
    4118.527     0.887500           59         8.89
    4448.255     0.900000           60        10.00
    4472.831     0.912500           61        11.43
    4567.039     0.925000           62        13.33
    4567.039     0.937500           62        16.00
    4870.143     0.943750           63        17.78
    4870.143     0.950000           63        20.00
    6455.295     0.956250           64        22.86
    6455.295     0.962500           64        26.67
    6455.295     0.968750           64        32.00
    6619.135     0.971875           65        35.56
    6619.135     0.975000           65        40.00
    6619.135     0.978125           65        45.71
    6619.135     0.981250           65        53.33
    6619.135     0.984375           65        64.00
    6918.143     0.985938           66        71.11
    6918.143     1.000000           66          inf
#[Mean    =     1667.111, StdDeviation   =     2034.019]
#[Max     =     6914.048, Total count    =           66]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  69 requests in 2.00m, 35.13KB read
  Socket errors: connect 0, read 0, write 0, timeout 28
  Non-2xx or 3xx responses: 29
Requests/sec:      0.57
Transfer/sec:     299.58B